In [1]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [10]:
cleaned = data.dropna()

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -1.498426 -0.399600 -0.317646
1 -0.041463 -1.134647 -0.347532
2  1.270190  0.674156 -0.266279
3  0.247580  0.575246  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [16]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.498426       NaN       NaN
1 -0.041463       NaN       NaN
2  1.270190       NaN -0.266279
3  0.247580       NaN  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [17]:
df.dropna()

          0         1         2
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [18]:
df.dropna(thresh=2)

          0         1         2
2  1.270190       NaN -0.266279
3  0.247580       NaN  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [19]:
df.fillna(0)

          0         1         2
0 -1.498426  0.000000  0.000000
1 -0.041463  0.000000  0.000000
2  1.270190  0.000000 -0.266279
3  0.247580  0.000000  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [20]:
df.fillna({1 : 0.5, 2 : 0})

          0         1         2
0 -1.498426  0.500000  0.000000
1 -0.041463  0.500000  0.000000
2  1.270190  0.500000 -0.266279
3  0.247580  0.500000  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [21]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.498426  0.000000  0.000000
1 -0.041463  0.000000  0.000000
2  1.270190  0.000000 -0.266279
3  0.247580  0.000000  0.536438
4 -1.116744  1.118245 -1.103889
5 -0.867655  0.136074  0.872340
6  0.960658 -0.293677  0.797589

In [22]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.266172  0.348635 -0.366589
1  1.047825 -0.564841  0.320408
2 -0.494403       NaN -0.671775
3 -1.339086       NaN  0.809269
4  0.635779       NaN       NaN
5  0.443830       NaN       NaN

In [23]:
df.fillna(method='ffill')

          0         1         2
0 -0.266172  0.348635 -0.366589
1  1.047825 -0.564841  0.320408
2 -0.494403 -0.564841 -0.671775
3 -1.339086 -0.564841  0.809269
4  0.635779 -0.564841  0.809269
5  0.443830 -0.564841  0.809269

In [24]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.266172  0.348635 -0.366589
1  1.047825 -0.564841  0.320408
2 -0.494403 -0.564841 -0.671775
3 -1.339086 -0.564841  0.809269
4  0.635779       NaN  0.809269
5  0.443830       NaN  0.809269

In [25]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [26]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [30]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [33]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [35]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [36]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [37]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [38]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [44]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [45]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [46]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [47]:
data.rename(index={'OHIO' : 'INDIANA'}, columns={'three' : 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [48]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [50]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [53]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [54]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [55]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [56]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.69, 0.91], (0.23, 0.46], (0.46, 0.69], (0.00035, 0.23], (0.00035, 0.23], ..., (0.00035, 0.23], (0.69, 0.91], (0.46, 0.69], (0.00035, 0.23], (0.69, 0.91]]
Length: 20
Categories (4, interval[float64]): [(0.00035, 0.23] < (0.23, 0.46] < (0.46, 0.69] < (0.69, 0.91]]

In [57]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.74, 3.061], (0.072, 0.74], (0.74, 3.061], (-3.759, -0.667], (0.74, 3.061], ..., (-0.667, 0.072], (0.072, 0.74], (0.74, 3.061], (-3.759, -0.667], (0.072, 0.74]]
Length: 1000
Categories (4, interval[float64]): [(-3.759, -0.667] < (-0.667, 0.072] < (0.072, 0.74] < (0.74, 3.061]]

In [58]:
pd.value_counts(cats)

(0.74, 3.061]       250
(0.072, 0.74]       250
(-0.667, 0.072]     250
(-3.759, -0.667]    250
dtype: int64

In [61]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017520    -0.004344     0.041996    -0.006933
std       0.976985     1.014686     1.043994     1.050567
min      -2.838965    -3.358549    -3.674599    -3.704256
25%      -0.652611    -0.746438    -0.688796    -0.689848
50%       0.013420     0.011701     0.010530     0.010498
75%       0.675229     0.713384     0.739102     0.666457
max       2.626010     3.171074     3.305515     3.220592

In [62]:
col = data[2]
col[np.abs(col) > 3]

677   -3.674599
841   -3.291115
921    3.305515
928    3.237998
Name: 2, dtype: float64

In [63]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
198 -0.613132 -0.052896  0.162954  3.019157
200 -0.087925  0.131207  2.771878  3.005095
419 -1.205897 -3.085534  0.615778 -1.608786
446  0.430924 -3.358549  0.301910 -0.460657
448 -0.594075  1.267149  0.146373 -3.202326
510  0.044744 -0.355322 -1.700642 -3.704256
596  0.492037 -0.339047  0.364399 -3.019890
677  1.440666 -0.015985 -3.674599 -1.315223
730 -0.860081  1.060184  0.466264  3.220592
740 -0.159412  3.171074  0.114506  2.462956
754  1.369112 -3.289185 -1.534038 -0.289659
807  1.796042 -2.417591  0.528707 -3.218360
841  1.651377  2.601348 -3.291115 -0.052668
921  1.045343  0.473734  3.305515 -0.351986
922  0.654609  1.739238 -0.456152 -3.141261
928  0.805018  0.760719  3.237998 -0.246193

In [64]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017520    -0.003782     0.042418    -0.005892
std       0.976985     1.011885     1.039295     1.045875
min      -2.838965    -3.000000    -3.000000    -3.000000
25%      -0.652611    -0.746438    -0.688796    -0.689848
50%       0.013420     0.011701     0.010530     0.010498
75%       0.675229     0.713384     0.739102     0.666457
max       2.626010     3.000000     3.000000     3.000000

In [68]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [69]:
sampler = np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [70]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [71]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [73]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
4    4
2   -1
2   -1
0    5
1    7
3    6
4    4
0    5
dtype: int64

In [74]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [75]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [76]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [77]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',header=None, names=mnames)
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [78]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [84]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [85]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [86]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [87]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [89]:
import re

data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [90]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object